<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Learning-SQL" data-toc-modified-id="Learning-SQL-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Learning SQL</a></span><ul class="toc-item"><li><span><a href="#RDBMS" data-toc-modified-id="RDBMS-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>RDBMS</a></span></li><li><span><a href="#Database-:" data-toc-modified-id="Database-:-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Database :</a></span></li><li><span><a href="#Table" data-toc-modified-id="Table-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Table</a></span></li><li><span><a href="#Table-Names" data-toc-modified-id="Table-Names-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Table Names</a></span></li><li><span><a href="#Schema" data-toc-modified-id="Schema-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Schema</a></span></li><li><span><a href="#Column" data-toc-modified-id="Column-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Column</a></span></li><li><span><a href="#Breaking-Up-Data" data-toc-modified-id="Breaking-Up-Data-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Breaking Up Data</a></span></li><li><span><a href="#Datatype" data-toc-modified-id="Datatype-1.8"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>Datatype</a></span></li><li><span><a href="#Datatype-Compatibility" data-toc-modified-id="Datatype-Compatibility-1.9"><span class="toc-item-num">1.9&nbsp;&nbsp;</span>Datatype Compatibility</a></span></li><li><span><a href="#Row" data-toc-modified-id="Row-1.10"><span class="toc-item-num">1.10&nbsp;&nbsp;</span>Row</a></span></li><li><span><a href="#Primary-key" data-toc-modified-id="Primary-key-1.11"><span class="toc-item-num">1.11&nbsp;&nbsp;</span>Primary key</a></span></li><li><span><a href="#Always-Define-Primary-Keys" data-toc-modified-id="Always-Define-Primary-Keys-1.12"><span class="toc-item-num">1.12&nbsp;&nbsp;</span>Always Define Primary Keys</a></span></li><li><span><a href="#What-Is-SQL?" data-toc-modified-id="What-Is-SQL?-1.13"><span class="toc-item-num">1.13&nbsp;&nbsp;</span>What Is SQL?</a></span></li><li><span><a href="#SQL-Extensions" data-toc-modified-id="SQL-Extensions-1.14"><span class="toc-item-num">1.14&nbsp;&nbsp;</span>SQL Extensions</a></span></li></ul></li><li><span><a href="#SQL-Statement-Syntax" data-toc-modified-id="SQL-Statement-Syntax-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>SQL Statement Syntax</a></span></li><li><span><a href="#Retrieving-Data" data-toc-modified-id="Retrieving-Data-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Retrieving Data</a></span><ul class="toc-item"><li><span><a href="#Presentation-of-Data" data-toc-modified-id="Presentation-of-Data-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Presentation of Data</a></span></li><li><span><a href="#wildcard-(*):" data-toc-modified-id="wildcard-(*):-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>wildcard (*):</a></span></li><li><span><a href="#Distinct-row" data-toc-modified-id="Distinct-row-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Distinct row</a></span><ul class="toc-item"><li><span><a href="#Caution:-Can’t-Be-Partially-DISTINCT" data-toc-modified-id="Caution:-Can’t-Be-Partially-DISTINCT-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span>Caution: Can’t Be Partially DISTINCT</a></span></li></ul></li><li><span><a href="#Limiting-Results" data-toc-modified-id="Limiting-Results-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Limiting Results</a></span></li><li><span><a href="#OFFSET-5" data-toc-modified-id="OFFSET-5-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>OFFSET 5</a></span><ul class="toc-item"><li><span><a href="#Caution:-Row-0" data-toc-modified-id="Caution:-Row-0-3.5.1"><span class="toc-item-num">3.5.1&nbsp;&nbsp;</span>Caution: Row 0</a></span></li></ul></li><li><span><a href="#Challenges" data-toc-modified-id="Challenges-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>Challenges</a></span></li></ul></li><li><span><a href="#Sorting-Retrieved-Data" data-toc-modified-id="Sorting-Retrieved-Data-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Sorting Retrieved Data</a></span><ul class="toc-item"><li><span><a href="#Clause" data-toc-modified-id="Clause-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Clause</a></span><ul class="toc-item"><li><span><a href="#Caution:-Position-of-ORDER-BY-Clause" data-toc-modified-id="Caution:-Position-of-ORDER-BY-Clause-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Caution: Position of ORDER BY Clause</a></span></li></ul></li><li><span><a href="#Specifying-Sort-Direction" data-toc-modified-id="Specifying-Sort-Direction-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Specifying Sort Direction</a></span></li><li><span><a href="#Sorting-by-Multiple-Columns" data-toc-modified-id="Sorting-by-Multiple-Columns-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Sorting by Multiple Columns</a></span></li><li><span><a href="#Sorting-by-Column-Position" data-toc-modified-id="Sorting-by-Column-Position-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Sorting by Column Position</a></span><ul class="toc-item"><li><span><a href="#Case-Sensitivity-and-Sort-Orders" data-toc-modified-id="Case-Sensitivity-and-Sort-Orders-4.4.1"><span class="toc-item-num">4.4.1&nbsp;&nbsp;</span>Case Sensitivity and Sort Orders</a></span></li></ul></li></ul></li><li><span><a href="#Filtering-Data" data-toc-modified-id="Filtering-Data-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Filtering Data</a></span><ul class="toc-item"><li><span><a href="#Using-the-WHERE-Clause" data-toc-modified-id="Using-the-WHERE-Clause-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Using the WHERE Clause</a></span><ul class="toc-item"><li><span><a href="#Caution:-WHERE-Clause-Position" data-toc-modified-id="Caution:-WHERE-Clause-Position-5.1.1"><span class="toc-item-num">5.1.1&nbsp;&nbsp;</span>Caution: WHERE Clause Position</a></span></li><li><span><a href="#When-to-Use-Quotes" data-toc-modified-id="When-to-Use-Quotes-5.1.2"><span class="toc-item-num">5.1.2&nbsp;&nbsp;</span>When to Use Quotes</a></span></li><li><span><a href="#!=-or-<>?" data-toc-modified-id="!=-or-<>?-5.1.3"><span class="toc-item-num">5.1.3&nbsp;&nbsp;</span>!= or &lt;&gt;?</a></span></li></ul></li><li><span><a href="#Checking-for-a-Range-of-Values" data-toc-modified-id="Checking-for-a-Range-of-Values-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Checking for a Range of Values</a></span></li><li><span><a href="#Checking-for-No-Value" data-toc-modified-id="Checking-for-No-Value-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Checking for No Value</a></span><ul class="toc-item"><li><span><a href="#Caution:-NULL-and-Nonmatches" data-toc-modified-id="Caution:-NULL-and-Nonmatches-5.3.1"><span class="toc-item-num">5.3.1&nbsp;&nbsp;</span>Caution: NULL and Nonmatches</a></span></li></ul></li></ul></li><li><span><a href="#Advanced-Data-Filtering" data-toc-modified-id="Advanced-Data-Filtering-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Advanced Data Filtering</a></span><ul class="toc-item"><li><span><a href="#Operator" data-toc-modified-id="Operator-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Operator</a></span></li><li><span><a href="#AND" data-toc-modified-id="AND-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>AND</a></span><ul class="toc-item"><li><span><a href="#Note:-No-ORDER-BY-Clause-Specified" data-toc-modified-id="Note:-No-ORDER-BY-Clause-Specified-6.2.1"><span class="toc-item-num">6.2.1&nbsp;&nbsp;</span>Note: No ORDER BY Clause Specified</a></span></li></ul></li><li><span><a href="#OR" data-toc-modified-id="OR-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>OR</a></span></li><li><span><a href="#Understanding-Order-of-Evaluation" data-toc-modified-id="Understanding-Order-of-Evaluation-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Understanding Order of Evaluation</a></span><ul class="toc-item"><li><span><a href="#Tip:-Using-Parentheses-in-WHERE-Clauses" data-toc-modified-id="Tip:-Using-Parentheses-in-WHERE-Clauses-6.4.1"><span class="toc-item-num">6.4.1&nbsp;&nbsp;</span>Tip: Using Parentheses in WHERE Clauses</a></span></li></ul></li><li><span><a href="#IN" data-toc-modified-id="IN-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>IN</a></span></li><li><span><a href="#NOT" data-toc-modified-id="NOT-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>NOT</a></span></li></ul></li><li><span><a href="#Using-Wildcard-Filtering" data-toc-modified-id="Using-Wildcard-Filtering-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Using Wildcard Filtering</a></span><ul class="toc-item"><li><span><a href="#Wildcards" data-toc-modified-id="Wildcards-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Wildcards</a></span></li><li><span><a href="#Search-pattern" data-toc-modified-id="Search-pattern-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Search pattern</a></span></li><li><span><a href="#Predicate" data-toc-modified-id="Predicate-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>Predicate</a></span></li><li><span><a href="#The-Percent-Sign-(%)-Wildcard" data-toc-modified-id="The-Percent-Sign-(%)-Wildcard-7.4"><span class="toc-item-num">7.4&nbsp;&nbsp;</span>The Percent Sign (%) Wildcard</a></span><ul class="toc-item"><li><span><a href="#Note:-Case-Sensitivity" data-toc-modified-id="Note:-Case-Sensitivity-7.4.1"><span class="toc-item-num">7.4.1&nbsp;&nbsp;</span>Note: Case Sensitivity</a></span></li><li><span><a href="#Tip:-Searching-for-Partial-Email-Addresses" data-toc-modified-id="Tip:-Searching-for-Partial-Email-Addresses-7.4.2"><span class="toc-item-num">7.4.2&nbsp;&nbsp;</span>Tip: Searching for Partial Email Addresses</a></span></li><li><span><a href="#Note:-Watch-for-Trailing-Spaces" data-toc-modified-id="Note:-Watch-for-Trailing-Spaces-7.4.3"><span class="toc-item-num">7.4.3&nbsp;&nbsp;</span>Note: Watch for Trailing Spaces</a></span></li><li><span><a href="#Caution:-Watch-for-NULL" data-toc-modified-id="Caution:-Watch-for-NULL-7.4.4"><span class="toc-item-num">7.4.4&nbsp;&nbsp;</span>Caution: Watch for NULL</a></span></li></ul></li><li><span><a href="#The-Underscore-(_)-Wildcard" data-toc-modified-id="The-Underscore-(_)-Wildcard-7.5"><span class="toc-item-num">7.5&nbsp;&nbsp;</span>The Underscore (_) Wildcard</a></span><ul class="toc-item"><li><span><a href="#Note:-Watch-for-Trailing-Spaces" data-toc-modified-id="Note:-Watch-for-Trailing-Spaces-7.5.1"><span class="toc-item-num">7.5.1&nbsp;&nbsp;</span>Note: Watch for Trailing Spaces</a></span></li></ul></li><li><span><a href="#The-Brackets-([])-Wildcard" data-toc-modified-id="The-Brackets-([])-Wildcard-7.6"><span class="toc-item-num">7.6&nbsp;&nbsp;</span>The Brackets ([]) Wildcard</a></span><ul class="toc-item"><li><span><a href="#Note:-Sets-Are-Not-Commonly-Supported" data-toc-modified-id="Note:-Sets-Are-Not-Commonly-Supported-7.6.1"><span class="toc-item-num">7.6.1&nbsp;&nbsp;</span>Note: Sets Are Not Commonly Supported</a></span></li></ul></li><li><span><a href="#Tips-for-Using-Wildcards" data-toc-modified-id="Tips-for-Using-Wildcards-7.7"><span class="toc-item-num">7.7&nbsp;&nbsp;</span>Tips for Using Wildcards</a></span></li></ul></li><li><span><a href="#Creating-Calculated-Fields" data-toc-modified-id="Creating-Calculated-Fields-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Creating Calculated Fields</a></span><ul class="toc-item"><li><span><a href="#Field" data-toc-modified-id="Field-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Field</a></span></li><li><span><a href="#Concatenate" data-toc-modified-id="Concatenate-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Concatenate</a></span><ul class="toc-item"><li><span><a href="#Caution:-Alias-Names" data-toc-modified-id="Caution:-Alias-Names-8.2.1"><span class="toc-item-num">8.2.1&nbsp;&nbsp;</span>Caution: Alias Names</a></span></li></ul></li><li><span><a href="#Performing-Mathematical-Calculations" data-toc-modified-id="Performing-Mathematical-Calculations-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>Performing Mathematical Calculations</a></span></li><li><span><a href="#SQL-Mathematical-Operators" data-toc-modified-id="SQL-Mathematical-Operators-8.4"><span class="toc-item-num">8.4&nbsp;&nbsp;</span>SQL Mathematical Operators</a></span></li></ul></li><li><span><a href="#Using-Data-Manipulation-Functions" data-toc-modified-id="Using-Data-Manipulation-Functions-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Using Data Manipulation Functions</a></span><ul class="toc-item"><li><span><a href="#Using-Functions" data-toc-modified-id="Using-Functions-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Using Functions</a></span></li><li><span><a href="#Text-Manipulation-Functions" data-toc-modified-id="Text-Manipulation-Functions-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>Text Manipulation Functions</a></span><ul class="toc-item"><li><span><a href="#Tip:-UPPERCASE,-lowercase,-MixedCase" data-toc-modified-id="Tip:-UPPERCASE,-lowercase,-MixedCase-9.2.1"><span class="toc-item-num">9.2.1&nbsp;&nbsp;</span>Tip: UPPERCASE, lowercase, MixedCase</a></span></li></ul></li><li><span><a href="#Date-and-Time-Manipulation-Functions" data-toc-modified-id="Date-and-Time-Manipulation-Functions-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>Date and Time Manipulation Functions</a></span></li><li><span><a href="#Numeric-Manipulation-Functions" data-toc-modified-id="Numeric-Manipulation-Functions-9.4"><span class="toc-item-num">9.4&nbsp;&nbsp;</span>Numeric Manipulation Functions</a></span></li></ul></li><li><span><a href="#Summarizing-Data" data-toc-modified-id="Summarizing-Data-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Summarizing Data</a></span><ul class="toc-item"><li><span><a href="#Using-Aggregate-Functions" data-toc-modified-id="Using-Aggregate-Functions-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>Using Aggregate Functions</a></span></li><li><span><a href="#Aggregate-Functions" data-toc-modified-id="Aggregate-Functions-10.2"><span class="toc-item-num">10.2&nbsp;&nbsp;</span>Aggregate Functions</a></span><ul class="toc-item"><li><span><a href="#Caution:-Individual-Columns-Only" data-toc-modified-id="Caution:-Individual-Columns-Only-10.2.1"><span class="toc-item-num">10.2.1&nbsp;&nbsp;</span>Caution: Individual Columns Only</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.2.2"><span class="toc-item-num">10.2.2&nbsp;&nbsp;</span>Note: NULL Values</a></span></li></ul></li><li><span><a href="#The-count-values" data-toc-modified-id="The-count-values-10.3"><span class="toc-item-num">10.3&nbsp;&nbsp;</span>The count values</a></span><ul class="toc-item"><li><span><a href="#Tip:-Using-MAX()-with-Nonnumeric-Data" data-toc-modified-id="Tip:-Using-MAX()-with-Nonnumeric-Data-10.3.1"><span class="toc-item-num">10.3.1&nbsp;&nbsp;</span>Tip: Using MAX() with Nonnumeric Data</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.3.2"><span class="toc-item-num">10.3.2&nbsp;&nbsp;</span>Note: NULL Values</a></span></li><li><span><a href="#Tip:-Using-MIN()-with-Nonnumeric-Data" data-toc-modified-id="Tip:-Using-MIN()-with-Nonnumeric-Data-10.3.3"><span class="toc-item-num">10.3.3&nbsp;&nbsp;</span>Tip: Using MIN() with Nonnumeric Data</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.3.4"><span class="toc-item-num">10.3.4&nbsp;&nbsp;</span>Note: NULL Values</a></span></li><li><span><a href="#Tip:-Performing-Calculations-on-Multiple-Columns" data-toc-modified-id="Tip:-Performing-Calculations-on-Multiple-Columns-10.3.5"><span class="toc-item-num">10.3.5&nbsp;&nbsp;</span>Tip: Performing Calculations on Multiple Columns</a></span></li><li><span><a href="#Note:-NULL-Values" data-toc-modified-id="Note:-NULL-Values-10.3.6"><span class="toc-item-num">10.3.6&nbsp;&nbsp;</span>Note: NULL Values</a></span></li></ul></li><li><span><a href="#Aggregates-on-Distinct-Values" data-toc-modified-id="Aggregates-on-Distinct-Values-10.4"><span class="toc-item-num">10.4&nbsp;&nbsp;</span>Aggregates on Distinct Values</a></span><ul class="toc-item"><li><span><a href="#Tip:-ALL-Is-Default" data-toc-modified-id="Tip:-ALL-Is-Default-10.4.1"><span class="toc-item-num">10.4.1&nbsp;&nbsp;</span>Tip: ALL Is Default</a></span></li><li><span><a href="#Caution:-No-DISTINCT-with-COUNT(*)" data-toc-modified-id="Caution:-No-DISTINCT-with-COUNT(*)-10.4.2"><span class="toc-item-num">10.4.2&nbsp;&nbsp;</span>Caution: No DISTINCT with COUNT(*)</a></span></li><li><span><a href="#Tip:-Using-DISTINCT-with-MIN()-and-MAX()" data-toc-modified-id="Tip:-Using-DISTINCT-with-MIN()-and-MAX()-10.4.3"><span class="toc-item-num">10.4.3&nbsp;&nbsp;</span>Tip: Using DISTINCT with MIN() and MAX()</a></span></li><li><span><a href="#Note:-Additional-Aggregate-Arguments" data-toc-modified-id="Note:-Additional-Aggregate-Arguments-10.4.4"><span class="toc-item-num">10.4.4&nbsp;&nbsp;</span>Note: Additional Aggregate Arguments</a></span></li><li><span><a href="#Caution:-Naming-Aliases" data-toc-modified-id="Caution:-Naming-Aliases-10.4.5"><span class="toc-item-num">10.4.5&nbsp;&nbsp;</span>Caution: Naming Aliases</a></span></li></ul></li></ul></li><li><span><a href="#Grouping-Data" data-toc-modified-id="Grouping-Data-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Grouping Data</a></span><ul class="toc-item"><li><span><a href="#Filtering-Groups" data-toc-modified-id="Filtering-Groups-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>Filtering Groups</a></span><ul class="toc-item"><li><span><a href="#Tip:-The-ALL-Clause" data-toc-modified-id="Tip:-The-ALL-Clause-11.1.1"><span class="toc-item-num">11.1.1&nbsp;&nbsp;</span>Tip: The ALL Clause</a></span></li><li><span><a href="#Caution:-Specifying-Columns-by-Relative-Position" data-toc-modified-id="Caution:-Specifying-Columns-by-Relative-Position-11.1.2"><span class="toc-item-num">11.1.2&nbsp;&nbsp;</span>Caution: Specifying Columns by Relative Position</a></span></li><li><span><a href="#Tip:-HAVING-Supports-All-WHERE’s-Operators" data-toc-modified-id="Tip:-HAVING-Supports-All-WHERE’s-Operators-11.1.3"><span class="toc-item-num">11.1.3&nbsp;&nbsp;</span>Tip: HAVING Supports All WHERE’s Operators</a></span></li><li><span><a href="#Note:-The-Difference-Between-HAVING-and-WHERE" data-toc-modified-id="Note:-The-Difference-Between-HAVING-and-WHERE-11.1.4"><span class="toc-item-num">11.1.4&nbsp;&nbsp;</span>Note: The Difference Between HAVING and WHERE</a></span></li><li><span><a href="#Note:-Using-HAVING-and-WHERE" data-toc-modified-id="Note:-Using-HAVING-and-WHERE-11.1.5"><span class="toc-item-num">11.1.5&nbsp;&nbsp;</span>Note: Using HAVING and WHERE</a></span></li><li><span><a href="#Tip:-Don’t-Forget-ORDER-BY" data-toc-modified-id="Tip:-Don’t-Forget-ORDER-BY-11.1.6"><span class="toc-item-num">11.1.6&nbsp;&nbsp;</span>Tip: Don’t Forget ORDER BY</a></span></li></ul></li><li><span><a href="#SELECT-Clause-Ordering" data-toc-modified-id="SELECT-Clause-Ordering-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>SELECT Clause Ordering</a></span></li></ul></li><li><span><a href="#Working-with-Subqueries" data-toc-modified-id="Working-with-Subqueries-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Working with Subqueries</a></span><ul class="toc-item"><li><span><a href="#Query" data-toc-modified-id="Query-12.1"><span class="toc-item-num">12.1&nbsp;&nbsp;</span>Query</a></span><ul class="toc-item"><li><span><a href="#Caution:-Single-Column-Only" data-toc-modified-id="Caution:-Single-Column-Only-12.1.1"><span class="toc-item-num">12.1.1&nbsp;&nbsp;</span>Caution: Single Column Only</a></span></li><li><span><a href="#Caution:-Subqueries-and-Performance" data-toc-modified-id="Caution:-Subqueries-and-Performance-12.1.2"><span class="toc-item-num">12.1.2&nbsp;&nbsp;</span>Caution: Subqueries and Performance</a></span></li></ul></li><li><span><a href="#Using-Subqueries-as-Calculated-Fields" data-toc-modified-id="Using-Subqueries-as-Calculated-Fields-12.2"><span class="toc-item-num">12.2&nbsp;&nbsp;</span>Using Subqueries as Calculated Fields</a></span><ul class="toc-item"><li><span><a href="#Caution:-Fully-Qualified-Column-Names" data-toc-modified-id="Caution:-Fully-Qualified-Column-Names-12.2.1"><span class="toc-item-num">12.2.1&nbsp;&nbsp;</span>Caution: Fully Qualified Column Names</a></span></li><li><span><a href="#Tip:-Subqueries-May-Not-Always-Be-the-Best-Option" data-toc-modified-id="Tip:-Subqueries-May-Not-Always-Be-the-Best-Option-12.2.2"><span class="toc-item-num">12.2.2&nbsp;&nbsp;</span>Tip: Subqueries May Not Always Be the Best Option</a></span></li></ul></li></ul></li><li><span><a href="#Joining-Tables" data-toc-modified-id="Joining-Tables-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Joining Tables</a></span><ul class="toc-item"><li><span><a href="#Scale" data-toc-modified-id="Scale-13.1"><span class="toc-item-num">13.1&nbsp;&nbsp;</span>Scale</a></span></li><li><span><a href="#Why-Use-Joins?" data-toc-modified-id="Why-Use-Joins?-13.2"><span class="toc-item-num">13.2&nbsp;&nbsp;</span>Why Use Joins?</a></span></li></ul></li></ul></div>

# Learning SQL

* Source code for  Sams Teach Yourself SQL in 10 Minutes Fifth Edition Ben Forta code: 

https://forta.com/books/0135182794/


* challenges
https://forta.com/books/0135182794/challenges/



1-  Introduction to SQL
- SQL is a standard language query for storing, manipulating and retrieving data in databases.
- Our SQL tutorial will teach you how to use SQL in: MySQL, SQL Server, MS Access, Oracle, Sybase, Informix, Postgres, and other database systems.
- SQL is a standard language for accessing and manipulating databases.

2- What is SQL?
* SQL stands for Structured Query Language
* SQL lets you access and manipulate databases
* SQL became a standard of the American National Standards Institute (ANSI) in 1986, and of the International Organization for Standardization (ISO) in 1987

3- What Can SQL do?
* SQL can execute queries against a database
* SQL can retrieve data from a database
* SQL can insert records in a database
* SQL can update records in a database
* SQL can delete records from a database
* SQL can create new databases
* SQL can create new tables in a database
* SQL can create stored procedures in a database
* SQL can create views in a database
* SQL can set permissions on tables, procedures, and views

## RDBMS

RDBMS stands for Relational Database Management System.

RDBMS is the basis for SQL, and for all modern database systems such as MS SQL Server, IBM DB2, Oracle, MySQL, and Microsoft Access.

The data in RDBMS is stored in database objects called tables. A table is a collection of related data entries and it consists of columns and rows.

Look at the "Customers" table:

## Database : 
A container (usually a file or set of files) to store organized data. People often use the term database to refer to the database software they are running. This is incorrect and a source of much confusion. 

Database software
is actually called the Database Management System (or DBMS). The
database is the container created and manipulated via the DBMS, and exactly
what the database is and what form it takes vary from one database to the
next.

## Table
A structured list of data of a specific type.
## Table Names
What makes a table name unique is actually a combination of several things
including the database name and table name. Some databases also use the
name of the database owner as part of the unique name. 

This means that while
you cannot use the same table name twice in the same database, you definitely
can reuse table names in different databases.

## Schema
Information about database and table layout and properties.

## Column
A single field in a table. All tables are made up of one or more columns.

## Breaking Up Data
It is extremely important to break data into multiple columns correctly. For
example, city, state, and ZIP (or postal) code should always be separate
columns. When you break these out, it becomes possible to sort or filter data
by specific columns (for example, to find all customers in a particular state or
in a particular city). If city and state are combined into one column, it would
be extremely difficult to sort or filter by state.

When you break up data, the level of granularity is up to you and your
specific requirements. For example, addresses are typically stored with the
house number and street name together. This is fine, unless you might one day
need to sort data by street name, in which case splitting house number and
street name would be preferable.

## Datatype
A type of allowed data. Every table column has an associated datatype that
restricts (or allows) specific data in that column.

## Datatype Compatibility
Datatypes and their names are one of the primary sources of SQL
incompatibility. While most basic datatypes are supported consistently, many
more advanced datatypes are not. And worse, occasionally you’ll find that the
same datatype is referred to by different names in different DBMSs. There is
not much you can do about this, but it is important to keep in mind when you
create table schemas.

## Row
A record in a table.

## Primary key
A column (or set of columns) whose values uniquely identify every row in a
table.


## Always Define Primary Keys
Although primary keys are not actually required, most database designers
ensure that every table they create has a primary key so that future data
manipulation is possible and manageable.

Any column in a table can be defined as the primary key, as long as it meets the
following conditions:
- No two rows can have the same primary key value.
- Every row must have a value in the primary key column(s). (So, no NULL values.)
- Values in primary key columns should never be modified or updated.
- Primary key values should never be reused. (If a row is deleted from the table, its primary key may not be assigned to any new rows in the future.)

## What Is SQL?
SQL (pronounced as the letters S-Q-L or as sequel) is an abbreviation for
Structured Query Language. SQL is a language designed specifically for
communicating with databases.

## SQL Extensions
Many DBMS vendors have extended their support for SQL by adding
statements or instructions to the language. The purpose of these extensions is
to provide additional functionality or simplified ways to perform specific
operations. And while often extremely useful, these extensions tend to be very
DBMS specific, and they are rarely supported by more than a single vendor.
Standard SQL is governed by the ANSI standards committee, and is thus
called ANSI SQL. All major DBMSs, even those with their own extensions,
support ANSI SQL. Individual implementations have their own names (PLSQL, used by Oracle; Transact-SQL, used by Microsoft SQL Server; and so
on).
For the most part, the SQL taught in this book is ANSI SQL. On the odd
occasion where DBMS-specific SQL is used, it is so noted.

# SQL Statement Syntax

``` mysql

ALTER TABLE tablename
(
ADD|DROP column datatype [NULL|NOT NULL] [CONSTRAINTS],
ADD|DROP column datatype [NULL|NOT NULL] [CONSTRAINTS],
...
);



COMMIT [TRANSACTION];



CREATE INDEX indexname
ON tablename (column, ...);



CREATE PROCEDURE procedurename [parameters] [options]
AS
SQL statement;




CREATE TABLE tablename
(
column datatype [NULL|NOT NULL] [CONSTRAINTS],
column datatype [NULL|NOT NULL] [CONSTRAINTS],
...
);




CREATE VIEW viewname AS
SELECT columns, ...
FROM tables, ...
[WHERE ...]
[GROUP BY ...]
[HAVING ...];



DELETE FROM tablename
[WHERE ...];



DROP INDEX|PROCEDURE|TABLE|VIEW indexname|procedurename|tablename|
viewname;



INSERT INTO tablename [(columns, ...)]
VALUES(values, ...);



INSERT INTO tablename [(columns, ...)]
SELECT columns, ... FROM tablename, ...
[WHERE ...];



ROLLBACK [TO savepointname];
OR
ROLLBACK TRANSACTION;



SELECT columnname, ...
FROM tablename, ...
[WHERE ...]
[UNION ...]
[GROUP BY ...]
[HAVING ...]
[ORDER BY ...];



UPDATE tablename
SET columname = value, ...
[WHERE ...];


```

``` mysql


create database teach_yourself_sql;

use teach_yourself_sql;



-- ----------------------
-- Create Customers table
-- ----------------------
CREATE TABLE Customers
(
  cust_id      char(10)  NOT NULL ,
  cust_name    char(50)  NOT NULL ,
  cust_address char(50)  NULL ,
  cust_city    char(50)  NULL ,
  cust_state   char(5)   NULL ,
  cust_zip     char(10)  NULL ,
  cust_country char(50)  NULL ,
  cust_contact char(50)  NULL ,
  cust_email   char(255) NULL 
);

-- -----------------------
-- Create OrderItems table
-- -----------------------
CREATE TABLE OrderItems
(
  order_num  int          NOT NULL ,
  order_item int          NOT NULL ,
  prod_id    char(10)     NOT NULL ,
  quantity   int          NOT NULL ,
  item_price decimal(8,2) NOT NULL 
);


-- -------------------
-- Create Orders table
-- -------------------
CREATE TABLE Orders
(
  order_num  int      NOT NULL ,
  order_date datetime NOT NULL ,
  cust_id    char(10) NOT NULL 
);

-- ---------------------
-- Create Products table
-- ---------------------
CREATE TABLE Products
(
  prod_id    char(10)      NOT NULL ,
  vend_id    char(10)      NOT NULL ,
  prod_name  char(255)     NOT NULL ,
  prod_price decimal(8,2)  NOT NULL ,
  prod_desc  text          NULL 
);

-- --------------------
-- Create Vendors table
-- --------------------
CREATE TABLE Vendors
(
  vend_id      char(10) NOT NULL ,
  vend_name    char(50) NOT NULL ,
  vend_address char(50) NULL ,
  vend_city    char(50) NULL ,
  vend_state   char(5)  NULL ,
  vend_zip     char(10) NULL ,
  vend_country char(50) NULL 
);


-- -------------------
-- Define primary keys
-- -------------------
ALTER TABLE Customers ADD PRIMARY KEY (cust_id);
ALTER TABLE OrderItems ADD PRIMARY KEY (order_num, order_item);
ALTER TABLE Orders ADD PRIMARY KEY (order_num);
ALTER TABLE Products ADD PRIMARY KEY (prod_id);
ALTER TABLE Vendors ADD PRIMARY KEY (vend_id);


-- -------------------
-- Define foreign keys
-- -------------------
ALTER TABLE OrderItems ADD CONSTRAINT FK_OrderItems_Orders FOREIGN KEY (order_num) REFERENCES Orders (order_num);
ALTER TABLE OrderItems ADD CONSTRAINT FK_OrderItems_Products FOREIGN KEY (prod_id) REFERENCES Products (prod_id);
ALTER TABLE Orders ADD CONSTRAINT FK_Orders_Customers FOREIGN KEY (cust_id) REFERENCES Customers (cust_id);
ALTER TABLE Products ADD CONSTRAINT FK_Products_Vendors FOREIGN KEY (vend_id) REFERENCES Vendors (vend_id);




-- ------------------------
-- Populate Customers table
-- ------------------------
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)
VALUES('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact)
VALUES('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)
VALUES('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)
VALUES('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com');
INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact)
VALUES('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard');

-- ----------------------
-- Populate Vendors table
-- ----------------------
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('BRS01','Bears R Us','123 Main Street','Bear Town','MI','44444', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('BRE02','Bear Emporium','500 Park Street','Anytown','OH','44333', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('DLL01','Doll House Inc.','555 High Street','Dollsville','CA','99999', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('FRB01','Furball Inc.','1000 5th Avenue','New York','NY','11111', 'USA');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('FNG01','Fun and Games','42 Galaxy Road','London', NULL,'N16 6PS', 'England');
INSERT INTO Vendors(vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country)
VALUES('JTS01','Jouets et ours','1 Rue Amusement','Paris', NULL,'45678', 'France');

-- -----------------------
-- Populate Products table
-- -----------------------
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BR01', 'BRS01', '8 inch teddy bear', 5.99, '8 inch teddy bear, comes with cap and jacket');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BR02', 'BRS01', '12 inch teddy bear', 8.99, '12 inch teddy bear, comes with cap and jacket');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BR03', 'BRS01', '18 inch teddy bear', 11.99, '18 inch teddy bear, comes with cap and jacket');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BNBG01', 'DLL01', 'Fish bean bag toy', 3.49, 'Fish bean bag toy, complete with bean bag worms with which to feed it');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BNBG02', 'DLL01', 'Bird bean bag toy', 3.49, 'Bird bean bag toy, eggs are not included');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('BNBG03', 'DLL01', 'Rabbit bean bag toy', 3.49, 'Rabbit bean bag toy, comes with bean bag carrots');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('RGAN01', 'DLL01', 'Raggedy Ann', 4.99, '18 inch Raggedy Ann doll');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('RYL01', 'FNG01', 'King doll', 9.49, '12 inch king doll with royal garments and crown');
INSERT INTO Products(prod_id, vend_id, prod_name, prod_price, prod_desc)
VALUES('RYL02', 'FNG01', 'Queen doll', 9.49, '12 inch queen doll with royal garments and crown');

-- ---------------------
-- Populate Orders table
-- ---------------------
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20005, '2020-05-01', '1000000001');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20006, '2020-01-12', '1000000003');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20007, '2020-01-30', '1000000004');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20008, '2020-02-03', '1000000005');
INSERT INTO Orders(order_num, order_date, cust_id)
VALUES(20009, '2020-02-08', '1000000001');

-- -------------------------
-- Populate OrderItems table
-- -------------------------
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20005, 1, 'BR01', 100, 5.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20005, 2, 'BR03', 100, 10.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20006, 1, 'BR01', 20, 5.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20006, 2, 'BR02', 10, 8.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20006, 3, 'BR03', 10, 11.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 1, 'BR03', 50, 11.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 2, 'BNBG01', 100, 2.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 3, 'BNBG02', 100, 2.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 4, 'BNBG03', 100, 2.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20007, 5, 'RGAN01', 50, 4.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 1, 'RGAN01', 5, 4.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 2, 'BR03', 5, 11.99);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 3, 'BNBG01', 10, 3.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 4, 'BNBG02', 10, 3.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20008, 5, 'BNBG03', 10, 3.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20009, 1, 'BNBG01', 250, 2.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20009, 2, 'BNBG02', 250, 2.49);
INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)
VALUES(20009, 3, 'BNBG03', 250, 2.49);
```

#  Retrieving Data
It is important to note that SQL statements are not case sensitive, so SELECT is
the same as select, which is the same as Select. Many SQL developers find
that using uppercase for all SQL keywords and lowercase for column and
table names makes code easier to read and debug. However, be aware that
while the SQL language is case-insensitive, the names of tables, columns, and
values may not be (that depends on your DBMS and how it is configured).

pip install mysql-connector
pip install mysql

In [51]:
# Create connection:
import mysql.connector
import pandas as pd
def query(query):
        mySql_connector = mysql.connector.connect(
        host="localhost", 
        user="root",
        passwd="We12501250@#%",
        database="teach_yourself_sql" , use_pure=True
        )
        
        data= pd.read_sql_query(query , mySql_connector  )
        return data
    
'''order = 10100
status = 'Shipped'
sql = """SELECT  * from orders where orderNumber = ?
         and status = ? order by orderNumber"""
df1 = pd.read_sql_query(sql, cnx, params=[order, status])
'''


data=query("""
SELECT prod_name
FROM Products;


""")
data

             prod_name
0    Fish bean bag toy
1    Bird bean bag toy
2  Rabbit bean bag toy
3    8 inch teddy bear
4   12 inch teddy bear
5   18 inch teddy bear
6          Raggedy Ann
7            King doll
8           Queen doll

In [52]:
data=query("""
SELECT prod_id, prod_name, prod_price
FROM Products;
""")
data

  prod_id            prod_name  prod_price
0  BNBG01    Fish bean bag toy        3.49
1  BNBG02    Bird bean bag toy        3.49
2  BNBG03  Rabbit bean bag toy        3.49
3    BR01    8 inch teddy bear        5.99
4    BR02   12 inch teddy bear        8.99
5    BR03   18 inch teddy bear       11.99
6  RGAN01          Raggedy Ann        4.99
7   RYL01            King doll        9.49
8   RYL02           Queen doll        9.49

## Presentation of Data
SQL statements typically return raw, unformatted data, and different DBMSs
and clients may display the data differently (with different alignment or
decimal places, for example). Data formatting is a presentation issue, not a
retrieval issue. Therefore, presentation is typically specified in the
application that displays the data. Actual retrieved data (without applicationprovided formatting) is rarely used.


## wildcard (*):

`As a rule, you are better off not using the * wildcard unless you really do
need every column in the table. Even though use of wildcards may save youthe time and effort needed to list the desired columns explicitly, retrieving
unnecessary columns usually slows down the performance of your retrieval
and your application.`

In [53]:
data=query("""
SELECT *
FROM Products;
""")
data

,prod_id,vend_id,prod_name,prod_price,prod_desc
0,BNBG01,DLL01,Fish bean bag toy,3.49,"Fish bean bag toy, complete with bean bag worm..."
1,BNBG02,DLL01,Bird bean bag toy,3.49,"Bird bean bag toy, eggs are not included"
2,BNBG03,DLL01,Rabbit bean bag toy,3.49,"Rabbit bean bag toy, comes with bean bag carrots"
3,BR01,BRS01,8 inch teddy bear,5.99,"8 inch teddy bear, comes with cap and jacket"
4,BR02,BRS01,12 inch teddy bear,8.99,"12 inch teddy bear, comes with cap and jacket"
5,BR03,BRS01,18 inch teddy bear,11.99,"18 inch teddy bear, comes with cap and jacket"
6,RGAN01,DLL01,Raggedy Ann,4.99,18 inch Raggedy Ann doll
7,RYL01,FNG01,King doll,9.49,12 inch king doll with royal garments and crown
8,RYL02,FNG01,Queen doll,9.49,12 inch queen doll with royal garments and crown

In [54]:
data=query("""
SELECT distinct vend_id
FROM Products;
""")
data

  vend_id
0   BRS01
1   DLL01
2   FNG01

## Distinct row

SELECT DISTINCT vend_id tells the DBMS to only return distinct (unique) vend_id
rows, and so only three rows are returned, as seen in the following output. If
used, the DISTINCT keyword must be placed directly in front of the column names 
### Caution: Can’t Be Partially DISTINCT
The DISTINCT keyword applies to all columns, not just the one it precedes. If
you were to specify SELECT DISTINCT vend_id, prod_price, six of the nine
rows would be retrieved because the combined specified columns produced
six unique combinations.

In [55]:
query("SELECT  vend_id, prod_price FROM Products;")

  vend_id  prod_price
0   DLL01        3.49
1   DLL01        3.49
2   DLL01        3.49
3   BRS01        5.99
4   BRS01        8.99
5   BRS01       11.99
6   DLL01        4.99
7   FNG01        9.49
8   FNG01        9.49

In [56]:
query("SELECT DISTINCT vend_id, prod_price FROM Products;")

  vend_id  prod_price
0   DLL01        3.49
1   BRS01        5.99
2   BRS01        8.99
3   BRS01       11.99
4   DLL01        4.99
5   FNG01        9.49

## Limiting Results
The previous statement uses the SELECT statement to retrieve a single column.
LIMIT 5 instructs the supported DBMSs to return no more than five rows. The
output from this statement is shown in the following code.

In [57]:
query('''SELECT prod_name
FROM Products
''')

             prod_name
0    Fish bean bag toy
1    Bird bean bag toy
2  Rabbit bean bag toy
3    8 inch teddy bear
4   12 inch teddy bear
5   18 inch teddy bear
6          Raggedy Ann
7            King doll
8           Queen doll

In [58]:
query('''SELECT prod_name
FROM Products
LIMIT 5 ''')

             prod_name
0    Fish bean bag toy
1    Bird bean bag toy
2  Rabbit bean bag toy
3    8 inch teddy bear
4   12 inch teddy bear

## OFFSET 5 
LIMIT 5 OFFSET 5 instructs supported DBMSs to return five rows starting from
row 5. The first number is the number of rows to retrieve, and the second is
where to start.

In [59]:
query('''SELECT prod_name
FROM Products
LIMIT 5 OFFSET 5;''')

            prod_name
0  18 inch teddy bear
1         Raggedy Ann
2           King doll
3          Queen doll

### Caution: Row 0
The first row retrieved is row 0, not row 1. As such, LIMIT 1 OFFSET 1 will
retrieve the second row, not the first one.

In [60]:
query('''SELECT prod_name
FROM Products
LIMIT 0 OFFSET 0;''')

Empty DataFrame
Columns: [prod_name]
Index: []

In [61]:
query('''SELECT prod_name
FROM Products
LIMIT 1 OFFSET 1;''')

           prod_name
0  Bird bean bag toy

## Challenges
1. Write a SQL statement to retrieve all customer IDs (cust_id) from the Customers table.

In [62]:
query('''SELECT cust_id
FROM Customers;''')

      cust_id
0  1000000001
1  1000000002
2  1000000003
3  1000000004
4  1000000005

2. The OrderItems table contains every item ordered (and some were ordered multiple times). Write a SQL statement to retrieve a list of the products (prod_id) ordered (not every order, just a unique list of products). Here’s a
hint: you should end up with seven unique rows displayed.

In [63]:
query('''SELECT distinct prod_id
FROM OrderItems;''')

  prod_id
0  BNBG01
1  BNBG02
2  BNBG03
3    BR01
4    BR02
5    BR03
6  RGAN01

3. Write a SQL statement that retrieves all columns from the Customers table and an alternate SELECT that retrieves just the customer ID. Use comments to comment out one SELECT so as to be able to run the other. (And, of course, test both statements.)

In [64]:
query('''
SELECT cust_id 
FROM Customers;

''')

      cust_id
0  1000000001
1  1000000002
2  1000000003
3  1000000004
4  1000000005

In [65]:
query('''
SELECT *
# SELECT cust_id 
FROM Customers;

''')

,cust_id,cust_name,cust_address,cust_city,cust_state,cust_zip,cust_country,cust_contact,cust_email
0,1000000001,Village Toys,200 Maple Lane,Detroit,MI,44444,USA,John Smith,sales@villagetoys.com
1,1000000002,Kids Place,333 South Lake Drive,Columbus,OH,43333,USA,Michelle Green,None
2,1000000003,Fun4All,1 Sunny Place,Muncie,IN,42222,USA,Jim Jones,jjones@fun4all.com
3,1000000004,Fun4All,829 Riverside Drive,Phoenix,AZ,88888,USA,Denise L. Stephens,dstephens@fun4all.com
4,1000000005,The Toy Store,4545 53rd Street,Chicago,IL,54545,USA,Kim Howard,None

# Sorting Retrieved Data
##  Clause
`SQL statements are made up of clauses, some required and some optional. A
clause usually consists of a keyword and supplied data. An example of this is
the SELECT statement’s FROM clause, which you saw in the last lesson.`

In [66]:
query('''
SELECT prod_name
FROM Products
ORDER BY prod_name;
''')

             prod_name
0   12 inch teddy bear
1   18 inch teddy bear
2    8 inch teddy bear
3    Bird bean bag toy
4    Fish bean bag toy
5            King doll
6           Queen doll
7  Rabbit bean bag toy
8          Raggedy Ann

### Caution: Position of ORDER BY Clause
When specifying an ORDER BY clause, be sure that it is the last clause in your
SELECT statement. If it is not the last clause, an error will be generated.

## Specifying Sort Direction
Data sorting is not limited to **`ascending sort orders`** (from A to Z). Although this is
the **`default`** sort order, the ORDER BY clause can also be used to sort in descending
order (from Z to A). To sort by descending order, you must specify the keyword
**`DESC`**.


## Sorting by Multiple Columns

In [67]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
ORDER BY prod_price desc, prod_name ;

''')

  prod_id  prod_price            prod_name
0    BR03       11.99   18 inch teddy bear
1   RYL01        9.49            King doll
2   RYL02        9.49           Queen doll
3    BR02        8.99   12 inch teddy bear
4    BR01        5.99    8 inch teddy bear
5  RGAN01        4.99          Raggedy Ann
6  BNBG02        3.49    Bird bean bag toy
7  BNBG01        3.49    Fish bean bag toy
8  BNBG03        3.49  Rabbit bean bag toy

## Sorting by Column Position
In addition to being able to specify sort order using column names, ORDER BY
also supports ordering specified by relative column position. The best way to
understand this is to look at an example:

In [68]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
ORDER BY 2 desc, 3 ;

''')

  prod_id  prod_price            prod_name
0    BR03       11.99   18 inch teddy bear
1   RYL01        9.49            King doll
2   RYL02        9.49           Queen doll
3    BR02        8.99   12 inch teddy bear
4    BR01        5.99    8 inch teddy bear
5  RGAN01        4.99          Raggedy Ann
6  BNBG02        3.49    Bird bean bag toy
7  BNBG01        3.49    Fish bean bag toy
8  BNBG03        3.49  Rabbit bean bag toy

###  Case Sensitivity and Sort Orders

When you are sorting textual data, is`A` the same as `a`? And does `a` come
before `B` or after `Z`? These are not theoretical questions, and the answers
depend on how the database is set up.


In dictionary sort order, A is treated the same as a, and that is the default
behavior for most DBMSs. However, most good DBMSs enable database
administrators to change this behavior if needed. (If your database contains
lots of foreign language characters, this might become necessary.)


The key here is that, if you do need an alternate sort order, you may not be
able to accomplish this with a simple ORDER BY clause.

Write a SQL statement to retrieve all customer names (cust_names) from the
Customers table, and display the results sorted from Z to A

In [69]:
query('''
SELECT cust_name
FROM Customers
order by 1 desc ;

''')

       cust_name
0   Village Toys
1  The Toy Store
2     Kids Place
3        Fun4All
4        Fun4All

# Filtering Data
## Using the WHERE Clause
Database tables usually contain large amounts of data, and you seldom need to
retrieve all the rows in a table. More often than not you’ll want to extract a subset
of the table’s data as needed for specific operations or reports. Retrieving just the
data you want involves specifying search criteria, also known as a filter
condition.

In [70]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE prod_price < 4;

''')

             prod_name  prod_price
0    Fish bean bag toy        3.49
1    Bird bean bag toy        3.49
2  Rabbit bean bag toy        3.49

### Caution: WHERE Clause Position
When using both ORDER BY and WHERE clauses, make sure that ORDER BY comes
after the WHERE. Otherwise, an error will be generated.


|Operator| Description|
|--------|------------|
| = | Equality|
| <> | Nonequality|
| !=  | Nonequality|
| <  | Less than|
|<= | Less than or equal to|
|!< | Not less than|
| > | Greater than|
| >= | Greater than or equal to |
| !>  | Not greater than |
| BETWEEN | Between two specified values |
IS NULL | Is a NULL value |

### When to Use Quotes
If you look closely at the conditions used in the above WHERE clauses, you will
notice that some values are enclosed within single quotes, and others are not.
The single quotes are used to delimit a string. If you are comparing a value
against a column that is a string datatype, the delimiting quotes are required.
Quotes are not used to delimit values used with numeric columns.

In [71]:
query('''
SELECT vend_id, prod_name
FROM Products
WHERE vend_id <> 'DLL01';

''')

  vend_id           prod_name
0   BRS01   8 inch teddy bear
1   BRS01  12 inch teddy bear
2   BRS01  18 inch teddy bear
3   FNG01           King doll
4   FNG01          Queen doll

###  != or <>?
Usually, you can use != and <> interchangeably. However, not all DBMSs
support both forms of the nonequality operator. If in doubt, consult your
DBMS documentation.

## Checking for a Range of Values
To check for a range of values, you can use the BETWEEN operator. Its syntax is a
little different from other WHERE clause operators because it requires two values:
the beginning and end of the range. The BETWEEN operator can be used, for
example, to check for all products that cost between $5 and $10 or for all dates
that fall between specified start and end dates.

In [72]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE prod_price between 4 and 10;

''')

            prod_name  prod_price
0   8 inch teddy bear        5.99
1  12 inch teddy bear        8.99
2         Raggedy Ann        4.99
3           King doll        9.49
4          Queen doll        9.49

## Checking for No Value
When a table is created, the table designer can specify whether or not individual
columns can contain no value. When a column contains no value, it is said to
contain a NULL value.

`No value, as opposed to a field containing 0, or an empty string, or just spaces`

In [73]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE prod_price BETWEEN 5 AND 10;

''')

            prod_name  prod_price
0   8 inch teddy bear        5.99
1  12 inch teddy bear        8.99
2           King doll        9.49
3          Queen doll        9.49

In [74]:
query('''
SELECT cust_name , cust_email
FROM Customers
''')

       cust_name             cust_email
0   Village Toys  sales@villagetoys.com
1     Kids Place                   None
2        Fun4All     jjones@fun4all.com
3        Fun4All  dstephens@fun4all.com
4  The Toy Store                   None

### Caution: NULL and Nonmatches
You might expect that when you filter to select all rows that do not have a
particular value, rows with a `NULL` will be returned. But they will not. `NULL` is
strange this way, and rows with `NULL` in the filter column are not returned
when filtering for matches or when filtering for nonmatches.

In [75]:
query('''
SELECT cust_name
FROM Customers
WHERE cust_email IS NULL;
''')

       cust_name
0     Kids Place
1  The Toy Store

# Advanced Data Filtering

## Operator
A special keyword used to join or change clauses within a WHERE clause. Also
known as logical operators.
## AND
A keyword used in a WHERE clause to specify that only rows matching all the
specified conditions should be retrieved.
### Note: No ORDER BY Clause Specified
`In the interests of saving space (and your typing), I omitted the ORDER BY clause in many of these examples. As such, it is entirely possible that your output won’t exactly match the output in the book. While the number ofreturned rows should always match, their order may not. Of course, feel free to add an ORDER BY clause if you’d like; it needs to go after the WHERE clause.`
## OR
A keyword used in a WHERE clause to specify that any rows matching either of
the specified conditions should be retrieved.

In [76]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
WHERE vend_id = 'DLL01' AND prod_price <= 4;

''')

  prod_id  prod_price            prod_name
0  BNBG01        3.49    Fish bean bag toy
1  BNBG02        3.49    Bird bean bag toy
2  BNBG03        3.49  Rabbit bean bag toy

In [77]:
query('''
SELECT prod_id, prod_price, prod_name
FROM Products
WHERE vend_id = 'DLL01' OR vend_id = 'BRS01';
''')

  prod_id  prod_price            prod_name
0    BR01        5.99    8 inch teddy bear
1    BR02        8.99   12 inch teddy bear
2    BR03       11.99   18 inch teddy bear
3  BNBG01        3.49    Fish bean bag toy
4  BNBG02        3.49    Bird bean bag toy
5  BNBG03        3.49  Rabbit bean bag toy
6  RGAN01        4.99          Raggedy Ann

## Understanding Order of Evaluation

![](.\i\6YuwE.jpg)

In [78]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE vend_id = 'DLL01' OR vend_id = 'BRS01'
AND prod_price >= 10;

''')

             prod_name  prod_price
0   18 inch teddy bear       11.99
1    Fish bean bag toy        3.49
2    Bird bean bag toy        3.49
3  Rabbit bean bag toy        3.49
4          Raggedy Ann        4.99

In [79]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE (vend_id = 'DLL01' OR vend_id = 'BRS01')
AND prod_price >= 10;

''')

            prod_name  prod_price
0  18 inch teddy bear       11.99

### Tip: Using Parentheses in WHERE Clauses
Whenever you write WHERE clauses that use both AND and OR operators, use
parentheses to explicitly group operators. Don’t ever rely on the default
evaluation order, even if it is exactly what you want. There is no downside to
using parentheses, and you are always better off eliminating any ambiguity

In [80]:
query('''
SELECT prod_name, prod_price
FROM Products
WHERE vend_id IN ('DLL01','BRS01')
ORDER BY prod_name;

''')

             prod_name  prod_price
0   12 inch teddy bear        8.99
1   18 inch teddy bear       11.99
2    8 inch teddy bear        5.99
3    Bird bean bag toy        3.49
4    Fish bean bag toy        3.49
5  Rabbit bean bag toy        3.49
6          Raggedy Ann        4.99

In [81]:
query('''SELECT prod_name, prod_price
FROM Products
WHERE vend_id = 'DLL01' OR vend_id = 'BRS01'
ORDER BY prod_name;''')

             prod_name  prod_price
0   12 inch teddy bear        8.99
1   18 inch teddy bear       11.99
2    8 inch teddy bear        5.99
3    Bird bean bag toy        3.49
4    Fish bean bag toy        3.49
5  Rabbit bean bag toy        3.49
6          Raggedy Ann        4.99

## IN
A keyword used in a WHERE clause to specify a list of values to be matched
using an OR comparison.

## NOT
A keyword used in a WHERE clause to negate a condition.

In [82]:
query('''
SELECT prod_name , vend_id
FROM Products
WHERE NOT vend_id = 'DLL01'
ORDER BY prod_name;
''')

            prod_name vend_id
0  12 inch teddy bear   BRS01
1  18 inch teddy bear   BRS01
2   8 inch teddy bear   BRS01
3           King doll   FNG01
4          Queen doll   FNG01

In [83]:
query('''
SELECT prod_name
FROM Products
WHERE vend_id <> 'DLL01'
ORDER BY prod_name;

''')

            prod_name
0  12 inch teddy bear
1  18 inch teddy bear
2   8 inch teddy bear
3           King doll
4          Queen doll

# Using Wildcard Filtering
## Wildcards
Special characters used to match parts of a value.
## Search pattern
A search condition made up of literal text, wildcard characters, or any
combination of the above.
## Predicate
When is an operator not an operator? When it is a “predicate.” Technically,
LIKE is a predicate, not an operator. The end result is the same. Just be aware
of this term in case you run across it in SQL documentation or manuals.
## The Percent Sign (%) Wildcard
The most frequently used wildcard is the percent sign (%). Within a search string,
% means match any number of occurrences of any character.Wildcards can be used anywhere within the search pattern, and multiple wildcards may be used as well.
### Note: Case Sensitivity
Depending on our DBMS and how it is configured, searches may be case
sensitive, in which case 'fish%' would not match Fish bean bag toy.
### Tip: Searching for Partial Email Addresses
There is one situation in which wildcards may indeed be useful in the middle
of a search pattern, and that is looking for email addresses based on a partial
address, such as WHERE email 'LIKE b%@forta.com'.
### Note: Watch for Trailing Spaces
Some DBMSs pad field contents with spaces. For example, if a column
expects 50 characters and the text stored is Fish bean bag toy (17
characters), 33 spaces may be appended to the text so as to fully fill the
column. This padding usually has no real impact on data and how it is used,
but it could negatively affect the just-used SQL statement. The clause WHERE
prod_name LIKE 'F%y' will only match prod_namethen it will not end with if
it starts with F and ends with y, and if the value is padded with spaces, then it
will not end with y and so Fish bean bag toy will not be retrieved. One
simple solution to this problem is to append a second % to the search pattern.
'F%y%' will also match characters (or spaces) after the y.
### Caution: Watch for NULL
It may seem that the % wildcard matches anything, but there is one exception:
NULL. Not even the clause WHERE prod_name LIKE '%' will match a row with
the value NULL as the product name.

In [84]:
query('''
SELECT prod_id, prod_name
FROM Products
WHERE prod_name LIKE '%bean bag%';
''')

  prod_id            prod_name
0  BNBG01    Fish bean bag toy
1  BNBG02    Bird bean bag toy
2  BNBG03  Rabbit bean bag toy

In [85]:
query('''
SELECT prod_name
FROM Products
WHERE prod_name LIKE 'F%y%';
''')

           prod_name
0  Fish bean bag toy

## The Underscore (_) Wildcard
The underscore is used just like %,
but instead of matching multiple characters, the underscore matches just a single
character.

### Note: Watch for Trailing Spaces
As in the previous example, you may have to append a wildcard to the pattern
for this example to work.

In [86]:
query('''
SELECT prod_id, prod_name
FROM Products
WHERE prod_name LIKE '__ inch teddy bear';
''')

  prod_id           prod_name
0    BR02  12 inch teddy bear
1    BR03  18 inch teddy bear

In [87]:
query('''
SELECT prod_id, prod_name
FROM Products
WHERE prod_name LIKE '% inch teddy bear';
''')

  prod_id           prod_name
0    BR01   8 inch teddy bear
1    BR02  12 inch teddy bear
2    BR03  18 inch teddy bear

## The Brackets ([]) Wildcard
The brackets ([]) wildcard is used to specify a set of characters, any one of
which must match a character in the specified position (the location of the
wildcard).

### Note: Sets Are Not Commonly Supported
Unlike the wildcards described thus far, the use of [] to create sets is not
supported by all DBMSs. Sets are supported in Microsoft SQL Server, but
are not supported in MySQL, Oracle, DB2, and SQLite. Consult your DBMS
documentation to determine if sets are supported.

In [88]:
query('''

SELECT cust_contact
FROM Customers
WHERE cust_contact LIKE '[JM]%'
ORDER BY cust_contact;

''')

Empty DataFrame
Columns: [cust_contact]
Index: []

## Tips for Using Wildcards

- Don’t overuse wildcards. If another search operator will do, use it instead.

- When you do use wildcards, try not to use them at the beginning of the search pattern unless absolutely necessary. Search patterns that begin with wildcards are the slowest to process.

- Pay careful attention to the placement of the wildcard symbols. If they are misplaced, you might not return the data you intended.

# Creating Calculated Fields
Data stored within a database’s tables is often not available in the exact format
needed by your applications. Here are some examples:
- You need to display a field containing the name of a company along with the company’s location, but that information is stored in separate table columns.
- City, state, and ZIP codes are stored in separate columns (as they should be), but your mailing label printing program needs them retrieved as one correctly formatted field.
- Column data is in mixed upper- and lowercase, and your report needs all data presented in uppercase.
- An OrderItems table stores item price and quantity, but not the expanded price (price multiplied by quantity) of each item. To print invoices, you need that expanded price.
- You need total, averages, or other calculations based on table data.
## Field
Essentially means the same thing as column and often used interchangeably,
although database columns are typically called columns and the term fields is
usually used in conjunction with calculated fields.

## Concatenate
Joining values together (by appending them to each other) to form a single
long value.

### Caution: Alias Names
Aliases may be single words or complete strings. If the latter is used, then the
string should be enclosed within quotes. This practice is legal but is stronglydiscouraged. While multiword names are indeed highly readable, they create
all sorts of problems for many client applications—so much so that one of the
most common uses of aliases is to rename multiword column names to singleword names (as explained above).

Aliases are also sometimes referred to as derived columns, so regardless of
the term you run across, they mean the same thing.

In [89]:
query('''
SELECT Concat(vend_name, ' (', vend_country, ')') as concat
FROM Vendors
ORDER BY vend_name;
''')

                    concat
0      Bear Emporium (USA)
1         Bears R Us (USA)
2    Doll House Inc. (USA)
3  Fun and Games (England)
4       Furball Inc. (USA)
5  Jouets et ours (France)

- The name stored in the vend_name column
- A string containing a space and an open parenthesisThe country stored in the vend_country column
- A string containing the close parenthesis

## Performing Mathematical Calculations

In [90]:
query('''
SELECT prod_id, quantity, item_price,
quantity*item_price AS expanded_price
FROM OrderItems
WHERE order_num = 20008;
''')

  prod_id  quantity  item_price  expanded_price
0  RGAN01         5        4.99           24.95
1    BR03         5       11.99           59.95
2  BNBG01        10        3.49           34.90
3  BNBG02        10        3.49           34.90
4  BNBG03        10        3.49           34.90

## SQL Mathematical Operators

| Operator | Description |
|--------|------------|
| + | Addition|
| - | Subtraction |
| * | Multiplication |
| / | Division |

# Using Data Manipulation Functions


| Function | Syntax |
|--------|------------|
| Extract part of a string |  DB2, Oracle, PostgreSQL, and SQLite use SUBSTR(). MariaDB, MySQL, and SQL Server use SUBSTRING(). | 
| Datatype conversion |  Oracle uses multiple functions, one for each conversion type. DB2, PostgreSQL, and SQL Server use CAST(). MariaDB, MySQL, and SQL Server use CONVERT(). | 
| Get current date | DB2 and PostgreSQL use CURRENT_DATE. MariaDB and MySQL use CURDATE(). Oracle uses SYSDATE. SQL Server uses GETDATE(). SQLite uses DATE(). | 


## Using Functions
**Most SQL implementations support the following types of functions:**
* Text functions are used to manipulate strings of text (for example, trimming or padding values and converting values to upper- and lowercase).
* Numeric functions are used to perform mathematical operations on numeric data (for example, returning absolute numbers and performing algebraic calculations).
* Date and time functions are used to manipulate date and time values and to extract specific components from these values (for example, returning differences between dates and checking date validity).
*  Formatting functions are used to generate user-friendly outputs (for example, displaying dates in local languages and formats, or currencies with the right symbols and comma placement).
*  System functions return information specific to the DBMS being used (for example, returning user login information).
## Text Manipulation Functions
### Tip: UPPERCASE, lowercase, MixedCase
As should be clear by now, SQL functions are not case sensitive, so you can
use upper(), UPPER(), Upper(), or substr(), SUBSTR(), SubStr(), and so on.
Case is a user preference, so do as you choose, but be consistent and don’t
keep changing styles in your code; it makes the SQL really hard to read.


| Function | Description |
|--------|------------|
| LEFT() (or use substring function | Returns characters from left of string |
| LENGTH() (also DATALENGTH() orLEN()) | Returns the length of a string |
| LOWER() | Converts string to lowercase |
| LTRIM() | Trims white space from left of string |
| RIGHT() (or use substring function) | Returns characters from right of string |
| RTRIM() Trims white space from right of string |
| SUBSTR() or SUBSTRING() | Extracts part of a string |
| SOUNDEX() | Returns a string’s SOUNDEX value |
| UPPER() | Converts string to uppercas |


## Date and Time Manipulation Functions
Date and times are stored in tables using datatypes, and each DBMS uses its own
special varieties. date and time functions are almost always used to read,
expand, and manipulate these values

## Numeric Manipulation Functions
These functions tend to be used primarily for algebraic, trigonometric, or geometric
calculations and, therefore, are not as frequently used as string or date and time
manipulation functions.

| Function | Description |
|--------|------------|
| ABS() | Returns a number’s absolute value |
| COS() | Returns the trigonometric cosine of a specified angle |
| EXP() | Returns the exponential value of a specific numberPI() Returns the value of PI |
| SIN() | Returns the trigonometric sine of a specified angle |
| SQRT() | Returns the square root of a specified number |
| TAN() | Returns the trigonometric tangent of a specified angle |

In [91]:
query('''
SELECT vend_name, UPPER(vend_name) AS vend_name_upcase , LOWER(vend_name) AS vend_name_lowcase
FROM Vendors
ORDER BY vend_name;
''')

         vend_name vend_name_upcase vend_name_lowcase
0    Bear Emporium    BEAR EMPORIUM     bear emporium
1       Bears R Us       BEARS R US        bears r us
2  Doll House Inc.  DOLL HOUSE INC.   doll house inc.
3    Fun and Games    FUN AND GAMES     fun and games
4     Furball Inc.     FURBALL INC.      furball inc.
5   Jouets et ours   JOUETS ET OURS    jouets et ours

In [92]:
query('''
SELECT order_date , YEAR(order_date) , order_num 
FROM Orders 
WHERE YEAR(order_date) = 2020;

''')

  order_date  YEAR(order_date)  order_num
0 2020-05-01              2020      20005
1 2020-01-12              2020      20006
2 2020-01-30              2020      20007
3 2020-02-03              2020      20008
4 2020-02-08              2020      20009

# Summarizing Data
## Using Aggregate Functions
It is often necessary to summarize data without actually retrieving it all, and SQL
provides special functions for this purpose. Using these functions, SQL queries
are often used to retrieve data for analysis and reporting purposes. Examples of
this type of retrieval are
* Determining the number of rows in a table (or the number of rows that meet some condition or contain a specific value)
* Obtaining the sum of a set of rows in a table
* Finding the highest, lowest, and average values in a table column (either for all rows or for specific rows)
## Aggregate Functions
Functions that operate on a set of rows to calculate and return a single value.

| Function | Description |
|--------|------------|
| AVG() | Returns a column’s average value |
| COUNT() | Returns the number of rows in a column |
| MAX() | Returns a column’s highest value |
| MIN() | Returns a column’s lowest value |
| SUM() | Returns the sum of a column’s values |

### Caution: Individual Columns Only
AVG() may only be used to determine the average of a specific numeric
column, and that column name must be specified as the function parameter. To
obtain the average value of multiple columns, you must use multiple AVG()
functions. The exception to this is when returning a single value that iscalculated from multiple columns, as will be explained later in this lesson.
### Note: NULL Values
Column rows containing NULL values are ignored by the AVG() function.
## The count values
1. Use COUNT(*) to count the number of rows in a table, whether columns contain values or NULL values.
2. Use COUNT(column) to count the number of rows that have values in a specific column, ignoring NULL values.

**Column rows with NULL values in them are ignored by the COUNT() function if a column name is specified, but not if the asterisk (*) is used.**

### Tip: Using MAX() with Nonnumeric Data
Although MAX() is usually used to find the highest numeric or date values,
many (but not all) DBMSs allow it to be used to return the highest value in
any columns including textual columns. When used with textual data, MAX()
returns the row that would be the last if the data were sorted by that column.
### Note: NULL Values
Column rows with NULL values in them are ignored by the MAX() function

### Tip: Using MIN() with Nonnumeric Data
Although MIN() is usually used to find the lowest numeric or date values,
many (but not all) DBMSs allow it to be used to return the lowest value in
any columns including textual columns. When used with textual data, MIN()
will return the row that would be first if the data were sorted by that column.
### Note: NULL Values
Column rows with NULL values in them are ignored by the MIN() function.

In [93]:
query('''
SELECT AVG(prod_price) AS avg_price , COUNT(*) AS num_prod_price , COUNT(prod_price) AS num_prod_price ,
MAX(prod_price) AS max_price , MIN(prod_price) AS min_price , SUM(prod_price) AS items_ordered
FROM Products;
''')

,avg_price,num_prod_price,num_prod_price,max_price,min_price,items_ordered
0,6.823333,9,9,11.99,3.49,61.41

In [94]:
query(''' SELECT SUM(item_price*quantity) AS total_price
FROM OrderItems
WHERE order_num = 20005;
''')

   total_price
0       1648.0

### Tip: Performing Calculations on Multiple Columns
All the aggregate functions can be used to perform calculations on multiple
columns using the standard mathematical operators, as shown in the example.
### Note: NULL Values
Column rows with NULL values in them are ignored by the SUM() function
## Aggregates on Distinct Values
1. To perform calculations on all rows, specify the ALL argument or specify no argument at all (because ALL is the default behavior).
2. To include only unique values, specify the DISTINCT argument.

### Tip: ALL Is Default
The ALL argument need not be specified because it is the default behavior. If
DISTINCT is not specified, ALL is assumed.

### Caution: No DISTINCT with COUNT(*)
DISTINCT may only be used with COUNT() if a column name is specified.
DISTINCT may not be used with COUNT(*). Similarly, DISTINCT must be used
with a column name and not with a calculation or expression.
### Tip: Using DISTINCT with MIN() and MAX()
Although DISTINCT can technically be used with MIN() and MAX(), there is
actually no value in doing so. The minimum and maximum values in a column
will be the same whether or not only distinct values are included.

### Note: Additional Aggregate Arguments
In addition to the DISTINCT and ALL arguments shown here, some DBMSs
support additional arguments such as TOP and TOP PERCENT that let you
perform calculations on subsets of query results. Refer to your DBMS
documentation to determine exactly what arguments are available to you.

### Caution: Naming Aliases
When specifying alias names to contain the results of an aggregate function,
try to not use the name of an actual column in the table. Although there is
nothing actually illegal about doing so, many SQL implementations do not
support this and will generate obscure error messages if you do so.

In [95]:
query('''
SELECT *
FROM Products
WHERE vend_id = 'DLL01';

''')

,prod_id,vend_id,prod_name,prod_price,prod_desc
0,BNBG01,DLL01,Fish bean bag toy,3.49,"Fish bean bag toy, complete with bean bag worm..."
1,BNBG02,DLL01,Bird bean bag toy,3.49,"Bird bean bag toy, eggs are not included"
2,BNBG03,DLL01,Rabbit bean bag toy,3.49,"Rabbit bean bag toy, comes with bean bag carrots"
3,RGAN01,DLL01,Raggedy Ann,4.99,18 inch Raggedy Ann doll

In [96]:
query('''
SELECT AVG( prod_price) AS avg_price
FROM Products
WHERE vend_id = 'DLL01';

''')

###

   avg_price
0      3.865

In [97]:
query('''
SELECT AVG(DISTINCT prod_price) AS avg_price
FROM Products
WHERE vend_id = 'DLL01';

''')

   avg_price
0       4.24

# Grouping Data
Groups are created using the GROUP BY clause in your SELECT statement.

1. GROUP BY clauses can contain as many columns as you want. This enables you to nest groups, providing you with more granular control over how data is grouped.
2. If you have nested groups in your GROUP BY clause, data is summarized at the last specified group. In other words, all the columns specified are evaluated together when grouping is established (so you won’t get data back for each individual column level).
3. Every column listed in GROUP BY must be a retrieved column or a valid expression (but not an aggregate function). If an expression is used in theSELECT, that same expression must be specified in GROUP BY. Aliases cannot be used.
4. Most SQL implementations do not allow GROUP BY columns with variablelength datatypes (such as text or memo fields).
5. Aside from the aggregate calculation statements, every column in your SELECT statement must be present in the GROUP BY clause.
6. If the grouping column contains a row with a NULL value, NULL will be returned as a group. If there are multiple rows with NULL values, they’ll all be grouped together. 

7. The GROUP BY clause must come after any WHERE clause and before any ORDER BY clause.

## Filtering Groups
In addition to being able to group data using GROUP BY, SQL also allows you to
filter which groups to include and which to exclude. For example, you might want
a list of all customers who have made at least two orders. To obtain this data, you
must filter based on the complete group, not on individual rows.

### Tip: The ALL Clause
Some SQL implementations (such as Microsoft SQL Server) support an
optional ALL clause within GROUP BY. This clause can be used to return all
groups, even those that have no matching rows (in which case the aggregate
would return NULL). Refer to your DBMS documentation to see if it supports
ALL.
### Caution: Specifying Columns by Relative Position
Some SQL implementations allow you to specify GROUP BY columns by the
position in the SELECT list. For example, GROUP BY 2,1 can mean group by the
second column selected and then by the first. Although this shorthand syntax
is convenient, it is not supported by all SQL implementations. Its use is also
risky in that it is highly susceptible to the introduction of errors when editing
SQL statements.

### Tip: HAVING Supports All WHERE’s Operators
In Lesson  “Advanced Data Filtering,” you learned about
WHERE clause conditions (including wildcard conditions and clauses with
multiple operators). All the techniques and options that you’ve learned about
WHERE can be applied to HAVING. The syntax is identical; just the keyword is
different.

In [98]:
query('''
SELECT vend_id, COUNT(*) AS num_prods
FROM Products
GROUP BY vend_id;

''')

  vend_id  num_prods
0   BRS01          3
1   DLL01          4
2   FNG01          2

### Note: The Difference Between HAVING and WHERE
Here’s another way to look it: WHERE filters before data is grouped, and
HAVING filters after data is grouped. This is an important distinction; rows that
are eliminated by a WHERE clause will not be included in the group. This could
change the calculated values, which in turn could affect which groups are
filtered based on the use of those values in the HAVING clause.

### Note: Using HAVING and WHERE
HAVING is so similar to WHERE that most DBMSs treat them as the same thing if
no GROUP BY is specified. Nevertheless, you should make that distinction
yourself. Use HAVING only in conjunction with GROUP BY clauses. Use WHERE
for standard row-level filtering.

| ORDER BY | GROUP BY |
|--------|------------|
| Sorts generated output. | Groups rows. The output might not be in group order, however. |
| Any columns (even columns not selected) may be used. | Only selected columns or expressions columns may be used, and every selected column expression must be used. |
| Never required. | Required if using columns (or expressions) withaggregate functions. |

### Tip: Don’t Forget ORDER BY
As a rule, anytime you use a GROUP BY clause, you should also specify an
ORDER BY clause. That is the only way to ensure that data will be sorted
properly. Never rely on GROUP BY to sort your data.

In [101]:
query('''
SELECT cust_id, COUNT(*) AS orders
FROM Orders
GROUP BY cust_id
HAVING COUNT(*) >= 2;
''')

      cust_id  orders
0  1000000001       2

In [103]:
query('''
SELECT vend_id, COUNT(*) AS num_prods
FROM Products
GROUP BY vend_id
HAVING COUNT(*) > 2;
''')

  vend_id  num_prods
0   BRS01          3
1   DLL01          4

In [105]:
query('''
SELECT order_num, COUNT(*) AS items
FROM OrderItems
GROUP BY order_num
HAVING COUNT(*) >= 3
ORDER BY items, order_num;
''')

   order_num  items
0      20006      3
1      20009      3
2      20007      5
3      20008      5

## SELECT Clause Ordering
| Clause | Description | Required |
|--------|-------------|----------|
| SELECT | **Columns or expressions to be returned** | **Yes** |
| FROM | **Table to retrieve data from** | **Only if selecting data from a table** |
| WHERE | **Row-level filtering** | **No** |
| GROUP BY | **Group specification** | **Only if calculating aggregates by group** |
| HAVING | **Group-level filtering** | **No** |
| ORDER BY | **Output sort order** | **No** |

# Working with Subqueries
## Query
Any SQL statement. However, the term is usually used to refer to SELECT
statements.

In [109]:
query('''
SELECT cust_id , order_num
FROM Orders
WHERE order_num 
''')

      cust_id  order_num
0  1000000001      20005
1  1000000001      20009
2  1000000003      20006
3  1000000004      20007
4  1000000005      20008

In [107]:
query('''
SELECT order_num
FROM OrderItems
WHERE prod_id = 'RGAN01'
''')

   order_num
0      20007
1      20008

In [110]:
query('''
SELECT cust_id
FROM Orders
WHERE order_num IN (20007 , 20008)
''')

      cust_id
0  1000000004
1  1000000005

In [106]:
query('''
SELECT cust_id
FROM Orders
WHERE order_num IN (SELECT order_num
FROM OrderItems
WHERE prod_id = 'RGAN01')
''')

      cust_id
0  1000000004
1  1000000005

In [112]:
query('''
SELECT cust_name, cust_contact
FROM Customers
WHERE cust_id IN (1000000004,1000000005);
''')

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

on nasted query and subqueries, the top-level query actually returned the desired data.
### Caution: Single Column Only
Subquery SELECT statements can only retrieve a single column. Attempting to
retrieve multiple columns will return an error.
### Caution: Subqueries and Performance
The code shown here works, and it achieves the desired result. However,
using subqueries is not always the most efficient way to perform this type of
data retrieval.

In [113]:
query('''
SELECT cust_name, cust_contact
FROM Customers
WHERE cust_id IN (SELECT cust_id
FROM Orders
WHERE order_num IN (SELECT order_num
FROM OrderItems
WHERE prod_id = 'RGAN01'));
''')

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

## Using Subqueries as Calculated Fields
Suppose you
wanted to display the total number of orders placed by every customer in your
Customers table. Orders are stored in the Orders table along with the appropriate
customer ID.
To perform this operation, follow these steps:
1. Retrieve the list of customers from the Customers table.
2. For each customer retrieved, count the number of associated orders in the Orders table.

In [115]:
query('''
SELECT COUNT(*) AS orders FROM Orders
WHERE cust_id = 1000000001;
''')

   orders
0       2

In [116]:
query('''
SELECT cust_name,
cust_state,
(SELECT COUNT(*)
FROM Orders
WHERE Orders.cust_id = Customers.cust_id) AS orders
FROM Customers
ORDER BY cust_name;
''')

       cust_name cust_state  orders
0        Fun4All         IN       1
1        Fun4All         AZ       1
2     Kids Place         OH       0
3  The Toy Store         IL       1
4   Village Toys         MI       2

In [117]:
query('''
SELECT cust_name,
cust_state,
(SELECT COUNT(*)
FROM Orders
WHERE cust_id = cust_id) AS orders
FROM Customers
ORDER BY cust_name;
''')

       cust_name cust_state  orders
0        Fun4All         IN       5
1        Fun4All         AZ       5
2     Kids Place         OH       5
3  The Toy Store         IL       5
4   Village Toys         MI       5

### Caution: Fully Qualified Column Names
You just saw a very important reason to use fully qualified column names.
Without the extra specificity, the wrong results were returned because the
DBMS misunderstood what you intended. Sometimes the ambiguity caused by
the presence of conflicting column names will actually cause the DBMS to
throw an error. For example, this might occur if your WHERE or ORDER BY
clause specified a column name that was present in multiple tables. A good
rule is that if you are ever working with more than one table in a SELECT
statement, then use fully qualified column names to avoid any and all
ambiguity.
### Tip: Subqueries May Not Always Be the Best Option
As explained earlier in this lesson, although the sample code shown here
works, it is often not the most efficient way to perform this type of data
retrieval. You will revisit this example when you learn about JOINs in the
next two lessons.

# Joining Tables
-> Suppose you had a database table containing a product list, with each product in
its own row. The kind of information you would store with each product would
include a description and price, along with vendor information about the company
that creates the product.
Now suppose that you had multiple products created by the same vendor. Where
would you store the vendor information (things like vendor name, address, and
contact information)? You wouldn’t want to store that data along with the
products for several reasons:

1. Because the vendor information is the same for each product that vendor produces, repeating the information for each product is a waste of time and
storage space.
2. If vendor information changes (for example, if the vendor moves or the contact info changes), you would need to update every occurrence of the
vendor information.
3. When data is repeated (that is, the vendor information is used with each product), there is a high likelihood that the data will not be entered identically each time. Inconsistent data is extremely difficult to use in reporting

## Scale
Able to handle an increasing load without failing. A well-designed database
or application is said to scale well.
## Why Use Joins?
160 / 533 :

In [119]:
import datetime
now = datetime.datetime.now()
print ("Current date and time : ")
print (now.strftime("%Y-%m-%d %H:%M:%S"))

Current date and time :
2021-07-23 15:27:05